title: Vulnerable Driver Load By Name
id: 72cd00d6-490c-4650-86ff-1d11f491daa1
status: experimental
description: Detects loading of known vulnerable drivers via the file name of the drivers..
references:
    - https://loldrivers.io/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/03
modified: 2025/03/03
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
logsource:
    product: windows
    category: driver_load
detection:
    selection:
        ImageLoaded|endswith:
            - '\enetechio64.sys'
            - '\agent64.sys'
            - '\smep_namco.sys'
            - '\wnbios.sys'
            - '\atlaccess.sys'
            - '\fd3b7234419fafc9bdd533f48896ed73_b816c5cd.sys'
            - '\asmio64.sys'
            - '\radhwmgr.sys'
            - '\bwrsh.sys'
            - '\nt2.sys'
            - '\1.sys'
            - '\dellbios.sys'
            - '\afd.sys'
            - '\truesight.sys'
            - '\ene.sys'
            - '\sbiosio64.sys'
            - '\asrautochkupddrv.sys'
            - '\driver7-x64.sys'
            - '\smep_capcom.sys'
            - '\gedevdrv.sys'
            - '\nstr.sys'
            - '\dh_kernel.sys'
            - '\fildds.sys'
            - '\stdcdrv64.sys'
            - '\winio64b.sys'
            - '\aoddriver.sys'
            - '\openlibsys.sys'
            - '\kfeco11x64.sys'
            - '\bandai.sys'
            - '\dbk64.sys'
            - '\phymem64.sys'
            - '\superbmc.sys'
            - '\windows8-10-32.sys'
            - '\amigendrv64.sys'
            - '\kevp64.sys'
            - '\wyproxy64.sys'
            - '\gdrv.sys'
            - '\amdpowerprofiler.sys'
            - '\vmdrv.sys'
            - '\hw.sys'
            - '\d4.sys'
            - '\szkg64.sys'
            - '\zam64.sys'
            - '\tmcomm.sys'
            - '\capcom.sys'
            - '\piddrv64.sys'
            - '\mtcbsv64.sys'
            - '\protects.sys'
            - '\asrrapidstartdrv.sys'
            - '\fpcie2com.sys'
            - '\nstrwsk.sys'
            - '\driver7-x86-withoutdbg.sys'
            - '\rwdrv.sys'
            - '\tfsysmon.sys'
            - '\vproeventmonitor.sys'
            - '\asrdrv104.sys'
            - '\rtsuer.sys'
            - '\alsysio64.sys'
            - '\kbdcap64.sys'
            - '\fiddrv64.sys'
            - '\ssport.sys'
            - '\ace-base.sys'
            - '\msrhook.sys'
            - '\smarteio64.sys'
            - '\dh_kernel_10.sys'
            - '\monitor_win10_x64.sys'
            - '\81.sys'
            - '\atszio.sys'
            - '\vdbsv64.sys'
            - '\msio64.sys'
            - '\iomap64.sys'
            - '\mhyprot3.sys'
            - '\directio64.sys'
            - '\asio32.sys'
            - '\testbone.sys'
            - '\viragt64.sys'
            - '\panio.sys'
            - '\asrdrv101.sys'
            - '\winio32b.sys'
            - '\amp.sys'
            - '\d3.sys'
            - '\biontdrv.sys'
            - '\b3.sys'
            - '\nbiolib_x64.sys'
            - '\nt4.sys'
            - '\cp2x72c.sys'
            - '\pdfwkrnl.sys'
            - '\ngiodriver.sys'
            - '\rtport.sys'
            - '\hwos2ec10x64.sys'
            - '\echo_driver.sys'
            - '\bw.sys'
            - '\winiodrv.sys'
            - '\magdrvamd64.sys'
            - '\c.sys'
            - '\asrsmartconnectdrv.sys'
            - '\wsdkd.sys'
            - '\chaos-rootkit.sys'
            - '\phlashnt.sys'
            - '\b1.sys'
            - '\se64a.sys'
            - '\viragt.sys'
            - '\lenovodiagnosticsdriver.sys'
            - '\netfilterdrv.sys'
            - '\ecsiodriverx64.sys'
            - '\filwfp.sys'
            - '\bsmi.sys'
            - '\asrdrv103.sys'
            - '\vboxusb.sys'
            - '\ncpl.sys'
            - '\elrawdsk.sys'
            - '\segwindrvx64.sys'
            - '\lurker.sys'
            - '\asio.sys'
            - '\tgsafe.sys'
            - '\inpoutx64.sys'
            - '\nt3.sys'
            - '\winflash64.sys'
            - '\glckio2.sys'
            - '\computerz.sys'
            - '\asrdrv10.sys'
            - '\cpupress.sys'
            - '\bs_rciow1064.sys'
            - '\sysconp.sys'
            - '\cpuz_x64.sys'
            - '\bs_hwmio64.sys'
            - '\t.sys'
            - '\bs_def.sys'
            - '\bsmix64.sys'
            - '\msr.sys'
            - '\asribdrv.sys'
            - '\vboxdrv.sys'
            - '\citmdrv_amd64.sys'
            - '\goad.sys'
            - '\sandra.sys'
            - '\dbutildrv2.sys'
            - '\ni.sys'
            - '\citmdrv_ia64.sys'
            - '\paniox64.sys'
            - '\winio64a.sys'
            - '\fh-ethercat_dio.sys'
            - '\eneio64.sys'
            - '\nscm.sys'
            - '\bsmemx64.sys'
            - '\bs_rcio.sys'
            - '\proxy64.sys'
            - '\gpu-z.sys'
            - '\gvcidrv64.sys'
            - '\csc.sys'
            - '\hwdetectng.sys'
            - '\winio32.sys'
            - '\directio32.sys'
            - '\driver7-x86.sys'
            - '\ntiolib.sys'
            - '\bs_hwmio64_w10.sys'
            - '\winring0.sys'
            - '\nvflsh64.sys'
            - '\wirwadrv.sys'
            - '\asromgdrv.sys'
            - '\probmon.sys'
            - '\bs_rcio64.sys'
            - '\d2.sys'
            - '\otipcibus.sys'
            - '\tdeio64.sys'
            - '\fidpcidrv.sys'
            - '\gametersafe.sys'
            - '\filnk.sys'
            - '\semav6msr.sys'
            - '\fiddrv.sys'
            - '\dcr.sys'
            - '\directio.sys'
            - '\my.sys'
            - '\irec.sys'
            - '\bs_def64.sys'
            - '\bs_i2cio.sys'
            - '\etdsupp.sys'
            - '\black.sys'
            - '\winio64c.sys'
            - '\ctiio64.sys'
            - '\sysinfodetectorx64.sys'
            - '\fairplaykd.sys'
            - '\b4.sys'
            - '\kprocesshacker.sys'
            - '\rtsper.sys'
            - '\rtcore64.sys'
            - '\avalueio.sys'
            - '\netproxydriver.sys'
            - '\panmonfltx64.sys'
            - '\windows-xp-64.sys'
            - '\t3.sys'
            - '\libnicm.sys'
            - '\mhyprot2.sys'
            - '\d.sys'
            - '\sysinfo.sys'
            - '\elbycdio.sys'
            - '\bwrs.sys'
            - '\gpcidrv64.sys'
            - '\viraglt64.sys'
            - '\amsdk.sys'
            - '\t8.sys'
            - '\piddrv.sys'
            - '\aswvmm.sys'
            - '\hpportiox64.sys'
            - '\bedaisy.sys'
            - '\eio.sys'
            - '\dcprotect.sys'
            - '\stdcdrvws64.sys'
            - '\lv561av.sys'
            - '\rtif.sys'
            - '\80.sys'
            - '\iqvw64.sys'
            - '\nvaudio.sys'
            - '\corsairllaccess64.sys'
            - '\cpuz.sys'
            - '\nt5.sys'
            - '\gameink.sys'
            - '\t7.sys'
            - '\asrdrv102.sys'
            - '\gtckmdfbs.sys'
            - '\hwos2ec7x64.sys'
            - '\lmiinfo.sys'
            - '\asrsetupdrv103.sys'
            - '\phymemx64.sys'
            - '\msio32.sys'
            - '\physmem.sys'
            - '\nicm.sys'
            - '\nt6.sys'
            - '\kerneld.amd64'
            - '\lgdcatcher.sys'
            - '\rzpnk.sys'
            - '\lgcoretemp.sys'
            - '\full.sys'
            - '\nchgbios2x64.sys'
            - '\b.sys'
            - '\blackbonedrv10.sys'
            - '\bs_flash64.sys'
            - '\wiseunlo.sys'
            - '\panmonflt.sys'
            - '\hwrwdrv.sys'
            - '\procexp.sys'
            - '\nvoclock.sys'
            - '\rtkio.sys'
            - '\windows7-32.sys'
            - '\asrdrv106.sys'
            - '\ioaccess.sys'
            - '\sfdrvx32.sys'
            - '\fidpcidrv64.sys'
            - '\amifldrv64.sys'
            - '\aswarpot.sys'
            - '\kfeco10x64.sys'
            - '\sysdrv3s.sys'
            - '\tdklib64.sys'
            - '\mydrivers.sys'
            - '\adv64drv.sys'
            - '\asmmap64.sys'
            - '\dellinstrumentation.sys'
            - '\asupio.sys'
            - '\iscflashx64.sys'
            - '\dbutil.sys'
            - '\dbutil_2_3.sys'
            - '\lha.sys'
            - '\wcpu.sys'
            - '\nvflash.sys'
            - '\atillk64.sys'
            - '\ucorew64.sys'
            - '\netflt.sys'
            - '\iomem64.sys'
            - '\cupfixerx64.sys'
            - '\winio64.sys'
            - '\cg6kwin2k.sys'
            - '\bs_i2c64.sys'
            - '\proxy32.sys'
            - '\phymem_ext64.sys'
            - '\cpuz141.sys'
            - '\speedfan.sys'
            - '\sepdrv3_1.sys'
            - '\ntiolib_x64.sys'
            - '\pchunter.sys'
            - '\amdryzenmasterdriver.sys'
            - '\iqvw64e.sys'
            - '\hostnt.sys'
            - '\winio32a.sys'
    condition: selection
falsepositives:
    - False positives may occur if one of the vulnerable driver names mentioned above didn't change its name between versions. So always make sure that the driver being loaded is the legitimate one and the non vulnerable version.
    - If you experience a lot of FP you could comment the driver name or its exact known legitimate location (when possible)
level: low
